[
    {
        "tag": "greeting",
        "patterns": [
            "Hi",
            "Hello",
            "Hey",
            "How are you?",
            "What's up?",
            "Greetings!",
            "Hi there!",
            "Hello, how are you?",
            "Hey there!",
            "Nice to meet you!",
            "Good morning",
            "Good afternoon",
            "Good evening",
            "Howdy!",
            "Hi everyone!",
            "Pleasure to meet you",
            "Hello there",
            "What's new?",
            "Good to see you",
            "How's it going?"
        ],
        "responses": [
            "Hi there! How can I assist you today? I’m here to guide you through the Skill4Future Program!",
            "Hello! I can help you find out all about the Skill4Future Program. What would you like to know?",
            "Hey! Hope you're having a great day. I’m here to answer any questions you have about the Skill4Future Program!",
            "Greetings! I can assist you with details like program eligibility, how to apply, and more.",
            "Hiya! Looking for information about Skill4Future? I can help with all the details!",
            "Hello there! I’m a chatbot designed to guide you through the Skill4Future Program. How can I help you?",
            "Hey! I can answer your questions about the Skill4Future Program, including program duration and eligibility.",
            "Hi there! Want to learn about the Skill4Future Program? I can provide all the details you need.",
            "Good morning! I’m here to assist you with everything about the Skill4Future Program. What can I help with today?",
            "Good afternoon! Looking for answers to questions on the Skill4Future Program? I’m ready to assist.",
            "Good evening! Let me know how I can guide you through the Skill4Future Program. What would you like to learn?",
            "Howdy! I can help with any information you need about the Skill4Future Program.",
            "Hi everyone! I’m your guide to the Skill4Future Program. Feel free to ask me anything!",
            "Pleasure to meet you! I’m here to help you with all things Skill4Future. How can I assist?",
            "Hello there! I’m here to help you learn all about the Skill4Future Program. Just let me know what you need!",
            "What’s new? I’m here to answer your questions about the Skill4Future Program. How can I assist?",
            "Good to see you! Need help with the Skill4Future Program? Let me know what you’re looking for.",
            "How’s it going? I can provide you with all the details you need on the Skill4Future Program.",
            "Hey there! Whether it’s about eligibility, application process, or program objectives, I’m here to help!",
            "Hi! I’m a chatbot designed to assist with the Skill4Future Program. How can I help you today?"
        ]
    },
    {
        "tag": "goodbye",
        "patterns": [
            "Bye",
            "See you later",
            "Goodbye",
            "Take care",
            "See ya!",
            "Farewell",
            "Later!",
            "Until next time",
            "Good night",
            "Have a great day",
            "Catch you later",
            "Talk to you soon",
            "Bye for now",
            "See you tomorrow",
            "Goodbye for now",
            "Take it easy",
            "See you soon",
            "Have a good one",
            "Adios",
            "Bye-bye"
        ],
        "responses": [
            "Goodbye! Have a great day ahead!",
            "Take care! Let me know if you need anything else.",
            "See you later! Feel free to reach out anytime.",
            "Bye! Have a productive day!",
            "Catch you later! Wishing you all the best!"
        ]
    }, 
    {
        "tag": "about_program",
        "patterns": [
            "What is the Skills4Future program?",
            "Tell me about the Skills4Future program",
            "Skills4Future program details",
            "What does the Skills4Future program do?",
            "Can you explain the Skills4Future program?",
            "Give me an overview of Skills4Future",
            "What's the focus of the Skills4Future program?",
            "Skills4Future program introduction",
            "What is Skills4Future all about?",
            "What does Skills4Future aim to accomplish?",
            "What are the goals of Skills4Future?",
            "What is the purpose of Skills4Future?",
            "How does the program work?",
            "What topics are covered in the program?",
            "Who runs the Skills4Future program?",
            "Why was Skills4Future created?",
            "What industries does Skills4Future target?",
            "What skills does Skills4Future teach?",
            "Is Skills4Future for students?",
            "What is the objective of Skills4Future?"
        ],
        "responses": [
            "The Skills4Future program empowers youth in higher and vocational education with Green skills through AI technologies.",
            "Skills4Future equips students with tools to thrive in an AI-driven world, emphasizing sustainable and green career paths.",
            "The program provides cutting-edge skills in AI and sustainable practices, preparing students for emerging industries.",
            "In partnership with the Edunet Foundation, the program bridges the gap between traditional education and industry requirements.",
            "Skills4Future focuses on Green skills and AI technologies, preparing students for a sustainable and innovative future."
        ]
    },
    {
        "tag": "program_need",
        "patterns": [
            "Why is the Skills4Future program needed?",
            "What is the importance of the Skills4Future program?",
            "Why focus on Green skills and AI?",
            "Explain the need for this program",
            "What problem does the Skills4Future program solve?",
            "Why do we need a program like Skills4Future?",
            "Why is AI and sustainability important?",
            "What gap does the Skills4Future program address?",
            "How does the program help the youth?",
            "Why invest in Green skills and AI?",
            "What challenges does Skills4Future address?",
            "Why are Green skills crucial?",
            "How does this program benefit society?",
            "What is the program's relevance?",
            "Why should students join this program?",
            "What industries benefit from Green skills?",
            "Why is AI education important?",
            "How does Skills4Future support the environment?",
            "What makes this program unique?",
            "How does it prepare for future jobs?"
        ],
        "responses": [
            "The program addresses the urgent need for sustainable practices across industries, equipping students with skills in AI and Green technologies to meet future demands.",
            "As green jobs are expected to grow to 20 million by 2030, the program ensures students are prepared for these emerging opportunities.",
            "This initiative bridges the gap between education and employability, tackling youth unemployment with industry-relevant skills.",
            "Skills4Future equips students with expertise in AI and Green technologies, making them future-ready for a rapidly changing job market.",
            "The program emphasizes sustainability and technology, critical areas for a prosperous, eco-friendly future."
        ]
    },
    {
        "tag": "program_objective",
        "patterns": [
            "What are the objectives of the Skills4Future program?",
            "What does the program aim to achieve?",
            "Goals of the Skills4Future program",
            "What is the main focus of this program?",
            "What is the mission of Skills4Future?",
            "What are the key objectives of this program?",
            "What does Skills4Future prioritize?",
            "How does the program benefit students?",
            "What are the core goals of Skills4Future?",
            "What's the main aim of this initiative?",
            "What is the ultimate goal of this program?",
            "What is the impact of Skills4Future?",
            "What does the program strive to accomplish?",
            "How does the program support student careers?",
            "What areas does Skills4Future focus on?",
            "What is the vision of Skills4Future?",
            "How does Skills4Future empower students?",
            "What are the achievements of the program?",
            "Why was the Skills4Future program designed?",
            "What outcomes does the program deliver?"
        ],
        "responses": [
            "The program aims to enhance employability by providing students with hands-on experience in Green skills and AI technologies.",
            "Skills4Future bridges the gap between traditional education and industry needs through practical, experiential learning.",
            "The initiative prepares students for careers in fast-evolving industries with a focus on sustainability and technology-driven solutions.",
            "By equipping students with essential skills in AI and sustainability, the program empowers them to contribute to a greener, more innovative world.",
            "The program ensures students are future-ready with a strong foundation in data analytics, AI, and green technologies."
        ]
    },
    {
        "tag": "eligibility",
        "patterns": [
            "Who is eligible for the Skills4Future program?",
            "What are the eligibility criteria for joining the program?",
            "Who can apply for this program?",
            "Is this program for students or professionals?",
            "Can high school students join the program?",
            "Is this program open to all students?",
            "Who can participate in Skills4Future?",
            "What qualifications are needed to join?",
            "Am I eligible for the Skills4Future program?",
            "What are the requirements for enrollment?",
            "Are there age restrictions for the program?",
            "Can I join if I am a working professional?",
            "Is prior knowledge of AI required?",
            "Do I need to be a technical student to apply?",
            "Who is the target audience for Skills4Future?",
            "What kind of students are accepted?",
            "Is vocational training a prerequisite?",
            "Can college students join?",
            "Do I need to have work experience?",
            "What educational background is required?"
        ],
        "responses": [
            "The program is designed for students in higher and vocational education, particularly those pursuing technical and scientific studies.",
            "Eligibility is open to students enrolled in higher education or vocational training, focusing on preparing them for careers in AI and Green technologies.",
            "This program caters to young learners aiming to enhance their employability in emerging industries.",
            "If you're a student in higher education or vocational training, this program is for you! It's tailored to equip you with cutting-edge skills.",
            "Skills4Future focuses on students eager to learn about AI and sustainability, ensuring they're ready for the future workforce."
        ]
    },
    {
        "tag": "how_to_apply",
        "patterns": [
            "How can I apply for the Skills4Future program?",
            "What is the application process for the program?",
            "Can you guide me on registering for the program?",
            "Where can I sign up for Skills4Future?",
            "What steps do I take to apply for this program?",
            "Is there an application form for Skills4Future?",
            "How do I enroll in this program?",
            "Where can I find the registration details?",
            "What's the procedure to join Skills4Future?",
            "How do I get started with Skills4Future?",
            "Where can I submit my application?",
            "Do I need to provide documents to apply?",
            "Is there a registration fee?",
            "What are the deadlines for applying?",
            "Where can I find the Skills4Future website?",
            "Can I apply online?",
            "What are the steps for course registration?",
            "How do I select the course I want to enroll in?",
            "Are there interviews for selection?",
            "What happens after I submit the form?"
        ],
        "responses": [
            "To apply for the Skills4Future program, visit the official website and navigate to the 'About' section. There, you'll find links to the Student Development Program with registration forms for both the Advanced and Foundation courses.",
            "You can apply by visiting the Skills4Future website, where detailed instructions and registration forms are available.",
            "Start your application by heading to the program's official site. Look for the 'Student Development Program' section and follow the provided instructions.",
            "The registration process is simple—just go to the Skills4Future website, choose your desired course, and fill out the online form with the required details.",
            "Visit the official Skills4Future website to access the registration forms for both the Advanced and Foundation courses. Follow the prompts to submit your application."
        ]
    },
    {
        "tag": "program_details",
        "patterns": [
            "What does the Skills4Future program do?",
            "How long does this program last?",
            "What are the benefits of this program?",
            "What's included in the Skills4Future program?",
            "What skills can I learn from this program?",
            "What kind of training does Skills4Future provide?",
            "What are the main features of this program?",
            "What is taught in the Skills4Future courses?",
            "Can you explain the program structure?",
            "What is the focus of the Skills4Future courses?",
            "What is unique about this program?",
            "What are the key highlights of Skills4Future?",
            "How is the program designed?",
            "What modules are included in the program?",
            "What topics are covered in Skills4Future?",
            "What does the curriculum focus on?",
            "How are the courses structured?",
            "What practical skills are taught?",
            "What technologies are introduced in this program?",
            "How does the program prepare students for careers?"
        ],
        "responses": [
            "The Skills4Future program includes courses designed to build technical and practical skills in AI and sustainability. The Foundation Course offers 50 hours of training, while the Advanced Course provides 160 hours.",
            "This program helps participants gain 45 - 100 technical skills, depending on the chosen course, through a blend of theory and hands-on learning.",
            "Skills4Future emphasizes experiential learning, offering structured courses in AI and Green technologies. Details can be found on the official website under the 'About' section.",
            "The program offers tailored courses to equip students with industry-relevant skills, focusing on sustainable practices and advanced AI applications.",
            "Students can benefit from practical learning experiences, acquiring critical skills in data analytics, AI, and sustainable technologies."
        ]
    },
    {
        "tag": "program_duration",
        "patterns": [
            "What is the duration of the Skills4Future program?",
            "How long does this program last?",
            "What is the time commitment for this program?",
            "How much time will I need to complete the program?",
            "What are the training hours for Skills4Future?",
            "Is the program full-time or part-time?",
            "How many hours are required for each course?",
            "What's the length of the Advanced Course?",
            "How long does the Foundation Course take?",
            "What's the overall time commitment for Skills4Future?",
            "What is the program schedule?",
            "How is the program divided in hours?",
            "Is the training flexible in time?",
            "What is the course timeline?",
            "Can I complete the course quickly?",
            "How many weeks does it take to finish?",
            "How long do I need to study daily?",
            "What is the duration of each module?",
            "Is the duration same for all courses?",
            "What is the shortest course duration?"
        ],
        "responses": [
            "The Foundation Course includes 50 hours of training, while the Advanced Course offers a more intensive 160-hour learning experience.",
            "The program's duration depends on the chosen course, with options ranging from 50 to 160 hours.",
            "Skills4Future provides flexible training durations to suit different learning needs: 50 hours for the Foundation Course and 160 hours for the Advanced Course.",
            "The training is structured to include 50 hours for foundational skills and 160 hours for advanced, in-depth learning.",
            "For detailed information on program durations and schedules, you can visit the Skills4Future website's 'About' section."
        ]
    },
    {
        "tag": "green_skills",
        "patterns": [
            "What are Green skills?",
            "Can you explain Green skills?",
            "Why are Green skills important?",
            "What role do Green skills play in the Skills4Future program?",
            "What do Green skills mean?",
            "How do Green skills help in careers?",
            "What are examples of Green skills?",
            "Are Green skills part of the curriculum?",
            "What is the focus on sustainability in this program?",
            "Why does the program emphasize Green skills?",
            "What industries use Green skills?",
            "Are Green jobs growing?",
            "What jobs need Green skills?",
            "How are Green skills taught in this program?",
            "What is the value of Green skills?",
            "Why should I learn Green skills?",
            "What are the benefits of Green skills?",
            "What topics are included in Green skills?",
            "What does the program say about sustainability?",
            "How do Green skills affect the future?"
        ],
        "responses": [
            "Green skills refer to the knowledge and abilities required to support sustainable and eco-friendly practices in various industries.",
            "These skills are essential for creating a sustainable future, focusing on reducing environmental impact and promoting green innovations.",
            "In the Skills4Future program, Green skills are taught alongside AI and Data Analytics to prepare students for careers in industries prioritizing sustainability.",
            "Green skills include expertise in renewable energy, waste management, sustainable design, and other eco-friendly practices.",
            "The program emphasizes Green skills to equip students for the growing demand in industries transitioning towards sustainability."
        ]
    },
    {
        "tag": "ai_technologies",
        "patterns": [
            "What AI technologies are covered in the program?",
            "Does the program teach Artificial Intelligence?",
            "What role does AI play in the program?",
            "What kind of AI training is included?",
            "Are AI and Data Analytics part of the curriculum?",
            "How does the program teach AI technologies?",
            "What AI skills can I learn in this program?",
            "Is Artificial Intelligence the focus of Skills4Future?",
            "What AI tools are introduced in the program?",
            "Does the program include practical AI training?",
            "What can I learn about AI in this course?",
            "How does the program use AI?",
            "What AI modules are taught here?",
            "What industries use AI from this program?",
            "What is the importance of AI in this course?",
            "Does the program include machine learning?",
            "How does AI help in Green skills?",
            "Can I learn advanced AI here?",
            "Is AI only for tech students?",
            "What is the focus of AI training here?"
        ],
        "responses": [
            "The Skills4Future program includes hands-on training in Artificial Intelligence, covering its practical applications in real-world scenarios.",
            "Students learn industry-relevant AI technologies and Data Analytics, preparing them for roles in AI-driven industries.",
            "The program focuses on foundational and advanced AI concepts, ensuring students gain the skills needed for emerging job markets.",
            "AI modules in the program highlight its role in sustainability and problem-solving in modern industries.",
            "Participants gain practical experience with AI tools and techniques, enhancing their ability to work in tech-driven environments."
        ]
    },
    {
        "tag": "contact",
        "patterns": [
            "How can I contact the program team?",
            "What is the contact information for the Skills4Future program?",
            "Can I talk to someone about the program?",
            "Where can I reach out for more information?",
            "Is there an email or phone number for the program team?",
            "How do I get in touch with the Skills4Future staff?",
            "Who can I contact for program details?",
            "Where do I go for program support or inquiries?",
            "Can I contact Skills4Future directly?",
            "Is there a way to ask questions to the program team?",
            "How do I get help with my application?",
            "What is the easiest way to contact Skills4Future?",
            "Is there a helpline for students?",
            "Where can I send my queries?",
            "Who do I talk to about problems?",
            "What is the program's support email?",
            "How can I get program assistance?",
            "Can I meet someone from the team?",
            "What is the best way to contact Skills4Future?",
            "Can I send a message to the team?"
        ],
        "responses": [
            "You can contact the program team through the official website's contact section. Fill out the required form, and someone will get back to you shortly.",
            "Visit the Skills4Future website for detailed contact information, including how to submit your queries.",
            "The program team can be reached via the contact section on the official website, where a simple form submission will connect you with support.",
            "For assistance, navigate to the Skills4Future website's contact page and provide your details in the inquiry form.",
            "Feel free to reach out through the website's contact section. The team is ready to assist with your questions."
        ]
    },
    {
        "tag": "program_partners",
        "patterns": [
            "Who are the program partners?",
            "Tell me about the partners of the Skills4Future program.",
            "Which organizations are involved in this program?",
            "Who supports the Skills4Future program?",
            "What entities are collaborating on this program?",
            "Who are the stakeholders in Skills4Future?",
            "What companies are behind this program?",
            "Who funds or manages Skills4Future?",
            "Which foundations or organizations are involved?",
            "Who are the key partners in this program?",
            "Who created the Skills4Future program?",
            "What companies back this program?",
            "Who designed Skills4Future?",
            "Is Skills4Future supported by any big organizations?",
            "Who are the program sponsors?",
            "What organizations are part of this initiative?",
            "Are there industry partners involved?",
            "What is the role of Shell India in this program?",
            "Who manages the program operations?",
            "Are there other foundations involved?"
        ],
        "responses": [
            "The Skills4Future program is a collaborative effort between Shell India Markets Private Limited and the Edunet Foundation.",
            "Shell India and Edunet Foundation have partnered to empower students with skills in AI and sustainability.",
            "This program brings together the expertise of Shell India and the Edunet Foundation to create impactful learning opportunities.",
            "Shell India Markets and the Edunet Foundation jointly run Skills4Future to address skill gaps in AI and sustainability.",
            "The program is backed by Shell India and Edunet Foundation, focusing on building a skilled workforce for future industries."
        ]
    },
    {
        "tag": "faqs",
        "patterns": [
            "Where can I find the FAQs?",
            "What questions do most people ask about this program?",
            "Do you have a section for frequently asked questions?",
            "Is there an FAQ section for the Skills4Future program?",
            "Can you guide me to the FAQ page?",
            "What common questions are answered about this program?",
            "Where are the frequently asked questions listed?",
            "Does the website have an FAQ section?",
            "What are the typical questions about this program?",
            "How do I access the FAQs for Skills4Future?",
            "Where can I find answers to common questions?",
            "Are there general questions answered online?",
            "Can I get help with common issues?",
            "What topics are covered in the FAQs?",
            "Is there a help page for Skills4Future?",
            "How do I find quick answers about the program?",
            "Where do I look for program-related FAQs?",
            "Are FAQs available for registration issues?",
            "Can I get answers to general doubts?",
            "What is the best place to find quick program details?"
        ],
        "responses": [
            "FAQs are available on the official Skills4Future website. Navigate to the FAQ or Help section for answers to common questions.",
            "You can find answers to frequently asked questions in the FAQ section on the program's website.",
            "Check out the Skills4Future website for a dedicated FAQ page to address common queries.",
            "The FAQ section on the official website has detailed answers to many common questions about the program.",
            "Visit the program's website to explore the FAQ section, which covers most of the queries participants might have."
        ]
    },
    {
        "tag": "learning_steps",
        "patterns": [
            "What will I learn in this program?",
            "What are the steps of the program?",
            "How does the program guide learners?",
            "What happens first in the course?",
            "What is the learning process like?",
            "What do I do after joining the program?",
            "Can you explain the program stages?",
            "What is the structure of the learning?",
            "How will I progress in this program?",
            "What will I learn step by step?",
            "What happens after I register?",
            "What comes first in the training?",
            "How is the course divided?",
            "What do students learn in order?",
            "What is the journey of a learner?",
            "What are the phases of this program?",
            "How is the learning broken down?",
            "What is the order of learning in this course?",
            "What do I learn at each step?",
            "Can you guide me through the program structure?"
        ],
        "responses": [
            "The program starts with foundational skills, like understanding AI and Green technologies, followed by practical training using real-world examples.",
            "You will begin with basic concepts, move to hands-on training, and finish with projects guided by mentors to prepare you for real-world challenges.",
            "The learning process includes theory, practical training, and project work to ensure you gain complete knowledge of AI and sustainability.",
            "First, you will learn foundational concepts. Then, you will work on practical projects and apply what you've learned in real-world scenarios.",
            "The program is divided into three main steps: learning core concepts, applying skills in projects, and receiving guidance from mentors for career readiness."
        ]
    }
]